tutorials/XiFluid/stratified/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue ft 0
    volScalarFieldValue fu 0
    volScalarFieldValue egr 0
);

regions
(
    boxToCell
    {
        box (0 0 -1) (1 0.01 1);
        fieldValues
        (
            volScalarFieldValue ft 0.07
            volScalarFieldValue fu 0.07
            volScalarFieldValue egr 0.01
        );
    }
);


// ************************************************************************* //
